GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author            Notes
 * 2021-12-20     BruceOu           the first version
 */

#include "drv_hard_i2c.h"

#ifdef RT_USING_I2C

#define LOG_TAG              "drv.i2c"
#include <rtdbg.h>

/* I2C DMA timeout in milliseconds */
#ifdef BSP_I2C_DMA_TIMEOUT
#define I2C_DMA_TIMEOUT_MS      BSP_I2C_DMA_TIMEOUT
#else
#define I2C_DMA_TIMEOUT_MS      1000
#endif

/* I2C DMA transfer threshold (bytes), only use DMA when length >= this value */
#ifdef BSP_I2C_DMA_TRANS_MIN_LEN
#define I2C_DMA_TRANS_MIN_LEN   BSP_I2C_DMA_TRANS_MIN_LEN
#else
#define I2C_DMA_TRANS_MIN_LEN   4
#endif

#if !defined(BSP_USING_HARD_I2C0) && !defined(BSP_USING_HARD_I2C1) && !defined(BSP_USING_HARD_I2C2) && !defined(BSP_USING_HARD_I2C3)  && !defined(BSP_USING_HARD_I2C4)  && !defined(BSP_USING_HARD_I2C5)
#error "Please define at least one BSP_USING_I2Cx"
/* this driver can be disabled at menuconfig → RT-Thread Components → Device Drivers */
#endif

#if defined(BSP_USING_HARD_I2C0)
struct rt_i2c_bus_device i2c0;
#endif /* BSP_USING_I2C0 */

#if defined(BSP_USING_HARD_I2C1)
struct rt_i2c_bus_device i2c1;
#endif /* BSP_USING_I2C1 */

#if defined(BSP_USING_HARD_I2C2)
struct rt_i2c_bus_device i2c2;
#endif /* BSP_USING_I2C2 */

#if defined(BSP_USING_HARD_I2C3)
struct rt_i2c_bus_device i2c3;
#endif /* BSP_USING_I2C3 */

#if defined(BSP_USING_HARD_I2C4)
struct rt_i2c_bus_device i2c4;
#endif /* BSP_USING_I2C4 */

#if defined(BSP_USING_HARD_I2C5)
struct rt_i2c_bus_device i2c5;
#endif /* BSP_USING_I2C5 */

#if defined(SOC_SERIES_GD32F5xx)
#define i2c_flag_get_gd                      i2c_add_flag_get
#define i2c_timing_config_gd                 i2c_add_timing_config
#define i2c_master_clock_config_gd           i2c_add_master_clock_config
#define i2c_enable_gd                        i2c_add_enable
#define i2c_flag_clear_gd                    i2c_add_flag_clear
#define i2c_stop_on_bus_gd                   i2c_add_stop_on_bus
#define i2c_transfer_byte_number_config_gd   i2c_add_transfer_byte_number_config
#define i2c_start_on_bus_gd                  i2c_add_start_on_bus
#define i2c_address10_enable_gd              i2c_add_address10_enable
#define i2c_address10_disable_gd             i2c_add_address10_disable
#define i2c_master_addressing_gd             i2c_add_master_addressing
#define i2c_data_transmit_gd                 i2c_add_data_transmit
#define i2c_data_receive_gd                  i2c_add_data_receive
#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
#define i2c_dma_enable_gd                    i2c_add_dma_enable
#define i2c_dma_disable_gd                   i2c_add_dma_disable
#endif

#define I2C_FLAG_RBNE_GD                     I2C_ADD_FLAG_RBNE
#define I2C_STAT_GD                          I2C_ADD_STAT
#define I2C_STAT_TBE_GD                      I2C_ADD_STAT_TBE
#define I2C_STAT_TI_GD                       I2C_ADD_STAT_TI
#define I2C_MASTER_RECEIVE_GD                I2C_ADD_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C_ADD_MASTER_TRANSMIT
#define I2C_FLAG_I2CBSY_GD                   I2C_ADD_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C_ADD_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C_ADD_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C_ADD_FLAG_STPDET
#define I2C_FLAG_TBE_GD                      I2C_ADD_FLAG_TBE
#define I2C_CTL0_GD(periph)                  I2C_ADD_CTL0(periph)
#define I2C_TDATA_GD(periph)                 I2C_ADD_TDATA(periph)
#define I2C_RDATA_GD(periph)                 I2C_ADD_RDATA(periph)
#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
#define I2C_DMA_TRANSMIT_GD                  I2C_ADD_DMA_TRANSMIT
#define I2C_DMA_RECEIVE_GD                   I2C_ADD_DMA_RECEIVE
#define I2C_FLAG_TCR_GD                      I2C_ADD_FLAG_TCR
#define MAX_RELOAD_SIZE                      255
/* Frame mode for multi-msg DMA transfer */
#define GD32_I2C_FIRST_FRAME                 BIT(0)    /* First msg: START, no AUTOEND */
#define GD32_I2C_FIRST_AND_LAST_FRAME        BIT(1)    /* Only one msg: START + AUTOEND */
#define GD32_I2C_NEXT_FRAME                  BIT(2)    /* Middle msg: no START, no AUTOEND */
#define GD32_I2C_LAST_FRAME                  BIT(3)    /* Last msg: no START, AUTOEND */
#define GD32_I2C_LAST_FRAME_NO_STOP          BIT(4)    /* Last msg without STOP */
#define GD32_I2C_FIRST_FRAME_RELOAD          BIT(5)    /* First msg: START, use RELOAD for next NO_START msg */
#define GD32_I2C_NEXT_FRAME_NO_START         BIT(6)    /* Continue from RELOAD, no START needed */
#define GD32_I2C_NEXT_FRAME_RELOAD           BIT(7)    /* Middle msg: RESTART, use RELOAD for next NO_START msg */
#endif /* BSP_USING_I2C_*_DMA */

#elif defined(SOC_SERIES_GD32E51x)
#define i2c_flag_get_gd                      i2c2_flag_get
#define i2c_timing_config_gd                 i2c_timing_config
#define i2c_master_clock_config_gd           i2c_master_clock_config
#define i2c_enable_gd                        i2c_enable
#define i2c_flag_clear_gd                    i2c2_flag_clear
#define i2c_data_receive_gd                  i2c_data_receive
#define i2c_data_transmit_gd                 i2c_data_transmit
#define i2c_address10_enable_gd              i2c_address10_enable
#define i2c_address10_disable_gd             i2c_address10_disable
#define i2c_master_addressing_gd             i2c2_master_addressing
#define i2c_transfer_byte_number_config_gd   i2c_transfer_byte_number_config
#define i2c_start_on_bus_gd                  i2c_start_on_bus
#define i2c_stop_on_bus_gd                   i2c_stop_on_bus

#define I2C_STAT_GD                          I2C2_STAT
#define I2C_STAT_TBE_GD                      I2C2_STAT_TBE
#define I2C_STAT_TI_GD                       I2C2_STAT_TI
#define I2C_MASTER_RECEIVE_GD                I2C2_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C2_MASTER_TRANSMIT
#define I2C_FLAG_RBNE_GD                     I2C2_FLAG_RBNE
#define I2C_FLAG_I2CBSY_GD                   I2C2_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C2_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C2_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C2_FLAG_STPDET
#define I2C_FLAG_TBE_GD                      I2C2_FLAG_TBE

