GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
#elif defined(SOC_SERIES_GD32M53x)
/* M53x functions don't have i2c_periph parameter (only one I2C) */
#define i2c_flag_get_gd(periph, flag)                i2c_flag_get(flag)
#define i2c_timing_config_gd(periph, psc, scl, sda)  i2c_timing_config(psc, scl, sda)
#define i2c_master_clock_config_gd(periph, h, l)     i2c_master_clock_config(h, l)
#define i2c_enable_gd(periph)                        i2c_enable()
#define i2c_flag_clear_gd(periph, flag)              i2c_flag_clear(flag)
#define i2c_data_receive_gd(periph)                  i2c_data_receive()
#define i2c_address10_enable_gd(periph)              i2c_address10_enable()
#define i2c_address10_disable_gd(periph)             i2c_address10_disable()
#define i2c_master_addressing_gd(periph, addr, dir)  i2c_master_addressing(addr, dir)
#define i2c_transfer_byte_number_config_gd(periph, n) i2c_transfer_byte_number_config(n)
#define i2c_start_on_bus_gd(periph)                  i2c_start_on_bus()
#define i2c_stop_on_bus_gd(periph)                   i2c_stop_on_bus()
/* make baseline write path compile */
#define i2c_data_transmit(periph, data)              i2c_data_transmit(data)

#define I2C_FLAG_RBNE_GD                     I2C_FLAG_RBNE
#define I2C_STAT_GD(periph)                  I2C_STAT
#define I2C_STAT_TBE_GD                      I2C_STAT_TBE
#define I2C_STAT_TI_GD                       I2C_STAT_TI
#define I2C_MASTER_RECEIVE_GD                I2C_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C_MASTER_TRANSMIT
#define I2C_FLAG_I2CBSY_GD                   I2C_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C_FLAG_STPDET
#define I2C_FLAG_TBE_GD                      I2C_FLAG_TBE

#else
#define i2c_flag_get_gd                      i2c_flag_get
#define i2c_timing_config_gd                 i2c_timing_config
#define i2c_master_clock_config_gd           i2c_master_clock_config
#define i2c_enable_gd                        i2c_enable
#define i2c_flag_clear_gd                    i2c_flag_clear
#define i2c_data_receive_gd                  i2c_data_receive
#define i2c_data_transmit_gd                 i2c_data_transmit
#define i2c_address10_enable_gd              i2c_address10_enable
#define i2c_address10_disable_gd             i2c_address10_disable
#define i2c_master_addressing_gd             i2c_master_addressing
#define i2c_transfer_byte_number_config_gd   i2c_transfer_byte_number_config
#define i2c_start_on_bus_gd                  i2c_start_on_bus
#define i2c_stop_on_bus_gd                   i2c_stop_on_bus

#define I2C_FLAG_RBNE_GD                     I2C_FLAG_RBNE
#define I2C_STAT_GD                          I2C_STAT
#define I2C_STAT_TBE_GD                      I2C_STAT_TBE
#define I2C_STAT_TI_GD                       I2C_STAT_TI
#define I2C_MASTER_RECEIVE_GD                I2C_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C_MASTER_TRANSMIT
#define I2C_FLAG_I2CBSY_GD                   I2C_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C_FLAG_STPDET
#define I2C_FLAG_TBE_GD                      I2C_FLAG_TBE

#endif

#if defined (SOC_SERIES_GD32F5xx)
#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
/* Atomic CTL1 config: NBYTES + RELOAD + AUTOEND */
#define i2c_nbytes_reload_autoend_config_gd(periph, nbytes, reload, autoend) do { \
    uint32_t _ctl1 = I2C_ADD_CTL1(periph); \
    _ctl1 &= ~(I2C_ADD_CTL1_BYTENUM | I2C_ADD_CTL1_RELOAD | I2C_ADD_CTL1_AUTOEND); \
    _ctl1 |= ((uint32_t)(nbytes) << 16); \
    if (reload) _ctl1 |= I2C_ADD_CTL1_RELOAD; \
    if (autoend) _ctl1 |= I2C_ADD_CTL1_AUTOEND; \
    I2C_ADD_CTL1(periph) = _ctl1; \
} while(0)
#endif /* BSP_USING_I2C_*_DMA */
#define IS_I2C_LEGACY(periph)  ((periph) == I2C0 || (periph) == I2C1 || (periph) == I2C2)
#elif defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32F3x0) || defined (SOC_SERIES_GD32F30x) \
   || defined (SOC_SERIES_GD32C11x) || defined (SOC_SERIES_GD32E23x) || defined (SOC_SERIES_GD32E11x)
#define IS_I2C_LEGACY(periph)  (1)
#elif defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32L23x) \
   || defined (SOC_SERIES_GD32F50x) || defined (SOC_SERIES_GD32G5x3) || defined (SOC_SERIES_GD32H77x) \
   || defined (SOC_SERIES_GD32M53x)
#define IS_I2C_LEGACY(periph)  (0)
#elif defined SOC_SERIES_GD32E51x
#define IS_I2C_LEGACY(periph)  ((periph) == I2C0 || (periph) == I2C1)
#endif

/* Compile-time I2C IP capability macros */
/* GD32_I2C_HAS_LEGACY_IP: Platform has Legacy I2C IP (use I2C_DATA register) */
#if defined(SOC_SERIES_GD32F4xx) || defined(SOC_SERIES_GD32F30x) || \
    defined(SOC_SERIES_GD32F3x0) || defined(SOC_SERIES_GD32C11x) || \
    defined(SOC_SERIES_GD32E23x) || defined(SOC_SERIES_GD32E11x) || \
    defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32E51x)
#define GD32_I2C_HAS_LEGACY_IP
#endif

/* GD32_I2C_HAS_NEW_IP: Platform has New I2C IP (use I2C_TDATA/I2C_RDATA registers) */
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || \
    defined(SOC_SERIES_GD32L23x) || defined(SOC_SERIES_GD32F50x) || \
    defined(SOC_SERIES_GD32G5x3) || defined(SOC_SERIES_GD32H77x) || \
    defined(SOC_SERIES_GD32M53x) || defined(SOC_SERIES_GD32F5xx) || \
    defined(SOC_SERIES_GD32E51x)
#define GD32_I2C_HAS_NEW_IP
#endif

#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
/* Static DMA configuration for each I2C */
#ifdef BSP_I2C0_RX_USING_DMA
static struct dma_config i2c0_dma_rx_cfg = I2C0_RX_DMA_CONFIG;
#endif
#ifdef BSP_I2C0_TX_USING_DMA
static struct dma_config i2c0_dma_tx_cfg = I2C0_TX_DMA_CONFIG;
#endif
#ifdef BSP_I2C1_RX_USING_DMA
static struct dma_config i2c1_dma_rx_cfg = I2C1_RX_DMA_CONFIG;
#endif
#ifdef BSP_I2C1_TX_USING_DMA
static struct dma_config i2c1_dma_tx_cfg = I2C1_TX_DMA_CONFIG;
#endif
#ifdef BSP_I2C2_RX_USING_DMA
static struct dma_config i2c2_dma_rx_cfg = I2C2_RX_DMA_CONFIG;
#endif
#ifdef BSP_I2C2_TX_USING_DMA
static struct dma_config i2c2_dma_tx_cfg = I2C2_TX_DMA_CONFIG;
#endif
#ifdef BSP_I2C3_RX_USING_DMA
static struct dma_config i2c3_dma_rx_cfg = I2C3_RX_DMA_CONFIG;
#endif
#ifdef BSP_I2C3_TX_USING_DMA
static struct dma_config i2c3_dma_tx_cfg = I2C3_TX_DMA_CONFIG;
#endif
#ifdef BSP_I2C4_RX_USING_DMA
static struct dma_config i2c4_dma_rx_cfg = I2C4_RX_DMA_CONFIG;
#endif
#ifdef BSP_I2C4_TX_USING_DMA
static struct dma_config i2c4_dma_tx_cfg = I2C4_TX_DMA_CONFIG;
#endif
#ifdef BSP_I2C5_RX_USING_DMA
static struct dma_config i2c5_dma_rx_cfg = I2C5_RX_DMA_CONFIG;
#endif
#ifdef BSP_I2C5_TX_USING_DMA
static struct dma_config i2c5_dma_tx_cfg = I2C5_TX_DMA_CONFIG;
#endif
#endif /* BSP_USING_I2C_*_DMA */

