GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0) \
 && !defined(SOC_SERIES_GD32F50x) && !defined(SOC_SERIES_GD32G5x3) && !defined(SOC_SERIES_GD32C11x) \
 && !defined(SOC_SERIES_GD32L23x) && !defined(SOC_SERIES_GD32E23x) && !defined(SOC_SERIES_GD32E11x) \
 && !defined(SOC_SERIES_GD32H77x) && !defined(SOC_SERIES_GD32M53x) && !defined(SOC_SERIES_GD32H7xx) \
 && !defined(SOC_SERIES_GD32F5xx)
static const struct gd32_i2c_bus gd_i2c_config[] = {
#ifdef BSP_USING_HARD_I2C0
    {
    I2C0,    /* uart peripheral index */

    RCU_I2C0, RCU_GPIOB, RCU_GPIOB,    /* periph clock, scl gpio clock, sda gpio clock */
#if defined (SOC_SERIES_GD32F30x)
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_6,            /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_7,           /* sda port, sda alternate, sda pin */
#else
        GPIOB, GPIO_AF_4, GPIO_PIN_6,             /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_AF_4, GPIO_PIN_7,            /* sda port, sda alternate, sda pin */
#endif
        &i2c0,
        "hwi2c0",
    },
#endif

#ifdef BSP_USING_HARD_I2C1
    {
    I2C1,    /* uart peripheral index */
#if defined (SOC_SERIES_GD32F30x)
        RCU_I2C1, RCU_GPIOB, RCU_GPIOB,       /* periph clock, scl gpio clock, sda gpio clock */

        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_10,           /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_11,          /* sda port, sda alternate, sda pin */
#else
        RCU_I2C1, RCU_GPIOH, RCU_GPIOB,       /* periph clock, scl gpio clock, sda gpio clock */

        GPIOH, GPIO_AF_4, GPIO_PIN_4,          /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_AF_4, GPIO_PIN_11,          /* sda port, sda alternate, sda pin */
#endif

        &i2c1,
        "hwi2c1",
    },
#endif

#ifdef BSP_USING_HARD_I2C2
    {
    I2C2,    /* uart peripheral index */

    RCU_I2C2, RCU_GPIOA, RCU_GPIOC,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOA, GPIO_AF_4, GPIO_PIN_8,    /* scl port, scl alternate, scl pin */
    GPIOC, GPIO_AF_4, GPIO_PIN_9,    /* sda port, sda alternate, sda pin */

        &i2c2,
        "hwi2c2",
    },
#endif

#ifdef BSP_USING_HARD_I2C3
    {
    I2C3,    /* uart peripheral index */

    RCU_I2C3, RCU_GPIOF, RCU_GPIOF,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOF, GPIO_AF_4, GPIO_PIN_14,    /* scl port, scl alternate, scl pin */
    GPIOF, GPIO_AF_4, GPIO_PIN_15,    /* sda port, sda alternate, sda pin */

        &i2c3,
        "hwi2c3",
    },
#endif
#ifdef BSP_USING_HARD_I2C4
    {
    I2C4,    /* uart peripheral index */

    RCU_I2C4, RCU_GPIOG, RCU_GPIOG,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOG, GPIO_AF_6, GPIO_PIN_7,    /* scl port, scl alternate, scl pin */
    GPIOG, GPIO_AF_6, GPIO_PIN_8,    /* sda port, sda alternate, sda pin */

        &i2c4,
        "hwi2c4",
    },
#endif
#ifdef BSP_USING_HARD_I2C5
    {
    I2C5,    /* uart peripheral index */

    RCU_I2C5, RCU_GPIOF, RCU_GPIOF,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOF, GPIO_AF_4, GPIO_PIN_11,    /* scl port, scl alternate, scl pin */
    GPIOF, GPIO_AF_4, GPIO_PIN_12,    /* sda port, sda alternate, sda pin */

        &i2c5,
        "hwi2c5",
    }
#endif
};
#else
static const struct gd32_i2c_bus gd_i2c_config[] = {
#ifdef BSP_USING_HARD_I2C0
    {
    /* uart peripheral index */
#if defined(SOC_SERIES_GD32M53x)
    I2C,
    RCU_I2C,
    I2C_EV_IRQn,
    I2C_ER_IRQn,
#else
    I2C0,
    RCU_I2C0,
#if defined(SOC_SERIES_GD32G5x3)
    I2C0_EV_WKUP_IRQn,
#else
    I2C0_EV_IRQn,
#endif
    I2C0_ER_IRQn,
#endif
    "hwi2c0",
    &i2c0,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C0_TX_USING_DMA
    &i2c0_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C0_RX_USING_DMA
    &i2c0_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C1
    {
    I2C1,
    RCU_I2C1,
#if defined(SOC_SERIES_GD32G5x3)
    I2C1_EV_WKUP_IRQn,
#else
    I2C1_EV_IRQn,
#endif
    I2C1_ER_IRQn,
    "hwi2c1",
    &i2c1,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C1_TX_USING_DMA
    &i2c1_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C1_RX_USING_DMA
    &i2c1_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C2
    {
    I2C2,
    RCU_I2C2,
#if defined(SOC_SERIES_GD32G5x3)
    I2C2_EV_WKUP_IRQn,
#else
    I2C2_EV_IRQn,
#endif
    I2C2_ER_IRQn,
    "hwi2c2",
    &i2c2,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C2_TX_USING_DMA
    &i2c2_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C2_RX_USING_DMA
    &i2c2_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C3
    {
    I2C3,
    RCU_I2C3,
#if defined(SOC_SERIES_GD32G5x3)
    I2C3_EV_WKUP_IRQn,
#else
    I2C3_EV_IRQn,
#endif
    I2C3_ER_IRQn,
    "hwi2c3",
    &i2c3,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C3_TX_USING_DMA
    &i2c3_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C3_RX_USING_DMA
    &i2c3_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C4
    {
    I2C4,
    RCU_I2C4,
    I2C4_EV_IRQn,
    I2C4_ER_IRQn,
    "hwi2c4",
    &i2c4,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C4_TX_USING_DMA
    &i2c4_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C4_RX_USING_DMA
    &i2c4_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C5
    {
    I2C5,
    RCU_I2C5,
    I2C5_EV_IRQn,
    I2C5_ER_IRQn,
    "hwi2c5",
    &i2c5,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C5_TX_USING_DMA
    &i2c5_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C5_RX_USING_DMA
    &i2c5_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    }
#endif
};
#endif

#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
/**
  * @brief  configure DMA channel for I2C transfer.
  * @param  dma
  * @param  periph_addr
  * @param  buf
  * @param  len
  * @param  direction
  * @retval None
  */
static void gd32_i2c_dma_config_channel(struct dma_config *dma, uint32_t periph_addr,
                                         uint8_t *buf, uint16_t len, uint32_t direction)
{
    dma_single_data_parameter_struct dma_init_struct;

    rcu_periph_clock_enable(dma->rcu);
    dma_deinit(dma->periph, dma->channel);
    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.periph_addr = periph_addr;
    dma_init_struct.memory0_addr = (uint32_t)buf;
    dma_init_struct.direction = direction;
    dma_init_struct.number = len;
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = dma->data_width;
    dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;
    dma_single_data_mode_init(dma->periph, dma->channel, &dma_init_struct);
    dma_channel_subperipheral_select(dma->periph, dma->channel, dma->subperiph);
    dma_circulation_disable(dma->periph, dma->channel);
    /* NOTE: Do NOT enable DMA channel here! Caller controls enable order. */
}

/**
  * @brief  wait for legacy I2C DMA completion.
  * @param  dma
  * @param  timeout
  * @retval 0 on success, -RT_ETIMEOUT on timeout
  */
static int gd32_i2c_legacy_dma_wait_complete(struct dma_config *dma, rt_tick_t timeout)
{
    rt_tick_t start = rt_tick_get();

    while (dma_flag_get(dma->periph, dma->channel, DMA_FLAG_FTF) != SET)
    {
        if (rt_tick_get() - start > timeout)
        {
            dma_channel_disable(dma->periph, dma->channel);
            dma_flag_clear(dma->periph, dma->channel, DMA_FLAG_FTF);
            return -RT_ETIMEOUT;
        }
        rt_thread_mdelay(1);
    }
    dma_channel_disable(dma->periph, dma->channel);
    dma_flag_clear(dma->periph, dma->channel, DMA_FLAG_FTF);
    return 0;
}

#ifdef GD32_I2C_HAS_NEW_IP
/**
  * @brief  calculate frame mode for new I2C DMA transfer.
  * @param  msg
  * @param  next_msg
  * @param  index
  * @param  num
  * @retval frame mode constant
  */
static uint32_t gd32_i2c_new_frame_mode(struct rt_i2c_msg *msg, struct rt_i2c_msg *next_msg,
                                          rt_uint32_t index, rt_uint32_t num)
{
    uint8_t next_has_no_start = (next_msg != RT_NULL) && (next_msg->flags & RT_I2C_NO_START);

    if (num == 1)
    {
        /* Single message */
        return (msg->flags & RT_I2C_NO_STOP) ? GD32_I2C_LAST_FRAME_NO_STOP : GD32_I2C_FIRST_AND_LAST_FRAME;
    }
    else if (index == 0)
    {
        /* First message of multiple */
        if (next_has_no_start)
            return GD32_I2C_FIRST_FRAME_RELOAD;  /* Use RELOAD for seamless continuation */
        else
            return GD32_I2C_FIRST_FRAME;
    }
    else if (index == num - 1)
    {
        /* Last message */
        return (msg->flags & RT_I2C_NO_STOP) ? GD32_I2C_LAST_FRAME_NO_STOP : GD32_I2C_LAST_FRAME;
    }
    else
    {
        /* Middle message */
        if (next_has_no_start)
            return GD32_I2C_NEXT_FRAME_RELOAD;  /* RESTART, then RELOAD for seamless continuation */
        else
            return GD32_I2C_NEXT_FRAME;
    }
}
#endif /* GD32_I2C_HAS_NEW_IP */
#endif

/**
  * @brief  wait for I2C flag with timeout.
  * @param  i2c_periph
  * @param  flag
  * @param  wait_set  1: wait until flag is set, 0: wait until flag is cleared
  * @param  timeout   timeout in ticks
  * @retval 0 on success, -RT_ETIMEOUT on timeout
  */
#define DEFINE_I2C_WAIT_FLAG(name, flag_get_func) \
static int name(uint32_t i2c_periph, uint32_t flag, \
                uint8_t wait_set, rt_tick_t timeout) \
{ \
    rt_tick_t start = rt_tick_get(); \
    while ((!flag_get_func(i2c_periph, flag)) == wait_set) \
    { \
        if (rt_tick_get() - start > timeout) return -RT_ETIMEOUT; \
    } \
    return 0; \
}

#ifdef GD32_I2C_HAS_LEGACY_IP
DEFINE_I2C_WAIT_FLAG(gd32_i2c_legacy_wait_flag, i2c_flag_get)
#endif

#ifdef GD32_I2C_HAS_NEW_IP
DEFINE_I2C_WAIT_FLAG(gd32_i2c_new_wait_flag, i2c_flag_get_gd)
#endif

#if (defined(BSP_USING_I2C_TX_DMA) || defined(BSP_USING_I2C_RX_DMA)) && defined(GD32_I2C_HAS_NEW_IP)
/**
  * @brief  new I2C DMA transfer (unified TX/RX).
  * @param  i2c_bus
  * @param  msg
  * @param  mode
  * @param  is_read
  * @retval 0 on success, non-zero on error
  */
static int gd32_i2c_new_dma_xfer(const struct gd32_i2c_bus *i2c_bus,
                                  struct rt_i2c_msg *msg, uint32_t mode,
                                  uint8_t is_read)
{
    uint32_t i2c_periph = i2c_bus->i2c_periph;
    struct dma_config *dma = is_read ? i2c_bus->dma_rx : i2c_bus->dma_tx;
    rt_tick_t timeout = rt_tick_from_millisecond(I2C_DMA_TIMEOUT_MS);
    rt_tick_t start;
    uint16_t shifted_addr = msg->addr << 1;
    uint16_t remaining = msg->len;
    uint8_t *p_current = msg->buf;
    uint32_t nbytes;

    /* Direction-specific parameters */
    uint32_t i2c_direction = is_read ? I2C_MASTER_RECEIVE_GD : I2C_MASTER_TRANSMIT_GD;
    uint32_t data_reg = is_read ? (uint32_t)&I2C_RDATA_GD(i2c_periph)
                                : (uint32_t)&I2C_TDATA_GD(i2c_periph);
    uint32_t dma_direction = is_read ? DMA_PERIPH_TO_MEMORY : DMA_MEMORY_TO_PERIPH;
    uint32_t dma_mode = is_read ? I2C_DMA_RECEIVE_GD : I2C_DMA_TRANSMIT_GD;
    const char *dir_str = is_read ? "rx" : "tx";

    /* Only first frame needs to wait for bus idle */
    uint8_t need_bus_idle_wait = (mode == GD32_I2C_FIRST_FRAME ||
                                   mode == GD32_I2C_FIRST_AND_LAST_FRAME ||
                                   mode == GD32_I2C_FIRST_FRAME_RELOAD);
    /* Send START unless NO_START flag */
    uint8_t need_start = !(msg->flags & RT_I2C_NO_START) &&
                          (mode != GD32_I2C_NEXT_FRAME_NO_START);
    uint8_t need_autoend = (mode == GD32_I2C_LAST_FRAME ||
                             mode == GD32_I2C_FIRST_AND_LAST_FRAME);
    /* Use RELOAD mode when next msg continues without START */
    uint8_t use_reload_for_next = (mode == GD32_I2C_FIRST_FRAME_RELOAD ||
                                    mode == GD32_I2C_NEXT_FRAME_RELOAD);
    /* Check if continuing from RELOAD */
    uint8_t continuing_from_reload = (msg->flags & RT_I2C_NO_START) != 0;

