GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
    /* Only configure address for new transfers, not when continuing from RELOAD */
    if (!continuing_from_reload)
    {
        i2c_master_addressing_gd(i2c_periph, shifted_addr, i2c_direction);
    }

    /* Wait for bus idle if starting new transfer */
    if (need_bus_idle_wait)
    {
        if (gd32_i2c_new_wait_flag(i2c_periph, I2C_FLAG_I2CBSY_GD, 0, timeout) != 0)
        {
            LOG_E("i2c seq %s bus busy timeout", dir_str);
            return -RT_EBUSY;
        }
    }

    while (remaining > 0)
    {
        uint8_t is_last_chunk = (remaining <= MAX_RELOAD_SIZE);
        nbytes = is_last_chunk ? remaining : MAX_RELOAD_SIZE;

        /* Configure DMA channel */
        gd32_i2c_dma_config_channel(dma, data_reg, p_current, nbytes, dma_direction);
        i2c_dma_enable_gd(i2c_periph, dma_mode);
        dma_channel_enable(dma->periph, dma->channel);

        /* Configure NBYTES + RELOAD + AUTOEND atomically */
        {
            uint8_t set_reload = !is_last_chunk || use_reload_for_next;
            uint8_t set_autoend = is_last_chunk && need_autoend;
            i2c_nbytes_reload_autoend_config_gd(i2c_periph, nbytes, set_reload, set_autoend);
        }

        /* Send START only for first chunk when needed */
        if (need_start && p_current == msg->buf)
        {
            i2c_start_on_bus_gd(i2c_periph);
        }

        /* Wait for DMA FTF */
        start = rt_tick_get();
        while (!dma_flag_get(dma->periph, dma->channel, DMA_FLAG_FTF))
        {
            if (rt_tick_get() - start > timeout)
            {
                LOG_E("i2c seq %s dma timeout", dir_str);
                goto error_exit;
            }
        }
        dma_flag_clear(dma->periph, dma->channel, DMA_FLAG_FTF);
        dma_channel_disable(dma->periph, dma->channel);

        p_current += nbytes;
        remaining -= nbytes;

        /* If more data in this msg, wait for TCR before next chunk */
        if (remaining > 0)
        {
            if (gd32_i2c_new_wait_flag(i2c_periph, I2C_FLAG_TCR_GD, 1, timeout) != 0)
            {
                LOG_E("i2c seq %s TCR timeout", dir_str);
                goto error_exit;
            }
        }
    }

    /* Wait for completion based on mode */
    if (need_autoend)
    {
        if (gd32_i2c_new_wait_flag(i2c_periph, I2C_FLAG_STPDET_GD, 1, timeout) != 0)
        {
            LOG_E("i2c seq %s STOP timeout", dir_str);
            goto error_exit;
        }
        i2c_flag_clear_gd(i2c_periph, I2C_FLAG_STPDET_GD);
    }
    else if (use_reload_for_next)
    {
        if (gd32_i2c_new_wait_flag(i2c_periph, I2C_FLAG_TCR_GD, 1, timeout) != 0)
        {
            LOG_E("i2c seq %s TCR timeout (reload)", dir_str);
            goto error_exit;
        }
    }
    else
    {
        if (gd32_i2c_new_wait_flag(i2c_periph, I2C_FLAG_TC_GD, 1, timeout) != 0)
        {
            LOG_E("i2c seq %s TC timeout", dir_str);
            goto error_exit;
        }
    }

    /* Cleanup */
    i2c_dma_disable_gd(i2c_periph, dma_mode);
    return 0;

error_exit:
    dma_channel_disable(dma->periph, dma->channel);
    i2c_dma_disable_gd(i2c_periph, dma_mode);
    i2c_stop_on_bus_gd(i2c_periph);
    return -RT_ETIMEOUT;
}
#endif /* (BSP_USING_I2C_TX_DMA || BSP_USING_I2C_RX_DMA) && GD32_I2C_HAS_NEW_IP */

#ifdef BSP_USING_I2C_TX_DMA
/**
  * @brief  legacy I2C TX DMA transfer.
  * @param  i2c_bus
  * @param  msg
  * @retval 0 on success, non-zero on error
  */
static int gd32_i2c_legacy_dma_write(const struct gd32_i2c_bus *i2c_bus, const struct rt_i2c_msg *msg)
{
#ifdef GD32_I2C_HAS_LEGACY_IP
    uint32_t i2c_periph = i2c_bus->i2c_periph;
    struct dma_config *dma_tx = i2c_bus->dma_tx;
    rt_tick_t timeout = rt_tick_from_millisecond(I2C_DMA_TIMEOUT_MS);
    int result;

    /* Configure DMA channel and enable I2C DMA
     * Official order: I2C DMA enable -> DMA channel enable */
    gd32_i2c_dma_config_channel(dma_tx, (uint32_t)&I2C_DATA(i2c_periph),
                                 msg->buf, msg->len, DMA_MEMORY_TO_PERIPH);
    i2c_dma_config(i2c_periph, I2C_DMA_ON);
    dma_channel_enable(dma_tx->periph, dma_tx->channel);

    /* Wait for DMA completion */
    result = gd32_i2c_legacy_dma_wait_complete(dma_tx, timeout);
    if (result != 0)
    {
        i2c_dma_config(i2c_periph, I2C_DMA_OFF);
        return result;
    }

    /* Wait for I2C BTC (Byte Transfer Complete) */
    if (gd32_i2c_legacy_wait_flag(i2c_periph, I2C_FLAG_BTC, 1, timeout) != 0)
    {
        i2c_dma_config(i2c_periph, I2C_DMA_OFF);
        return -RT_ETIMEOUT;
    }

    /* Disable I2C DMA */
    i2c_dma_config(i2c_periph, I2C_DMA_OFF);

    return 0;
#else
    (void)i2c_bus;
    (void)msg;
    return -RT_ENOSYS;
#endif
}
#endif /* BSP_USING_I2C_TX_DMA */

#if defined(BSP_USING_I2C_RX_DMA) && defined(GD32_I2C_HAS_LEGACY_IP)
/**
  * @brief  legacy I2C RX DMA transfer.
  * @param  i2c_bus
  * @param  msg
  * @retval 0 on success, non-zero on error
  */
static int gd32_i2c_legacy_dma_read(const struct gd32_i2c_bus *i2c_bus, const struct rt_i2c_msg *msg)
{
    uint32_t i2c_periph = i2c_bus->i2c_periph;
    struct dma_config *dma_rx = i2c_bus->dma_rx;
    rt_tick_t timeout = rt_tick_from_millisecond(I2C_DMA_TIMEOUT_MS);
    int result;

    /* CRITICAL: Configure and enable DMA BEFORE clearing ADDSEND (DMALST timing) */
    gd32_i2c_dma_config_channel(dma_rx, (uint32_t)&I2C_DATA(i2c_periph),
                                 msg->buf, msg->len, DMA_PERIPH_TO_MEMORY);
    i2c_dma_last_transfer_config(i2c_periph, I2C_DMALST_ON);
    i2c_dma_config(i2c_periph, I2C_DMA_ON);
    dma_channel_enable(dma_rx->periph, dma_rx->channel);

    /* Now clear ADDSEND to start I2C clock */
    i2c_flag_clear(i2c_periph, I2C_FLAG_ADDSEND);

    /* Wait for DMA completion */
    result = gd32_i2c_legacy_dma_wait_complete(dma_rx, timeout);

    /* Send STOP */
    i2c_stop_on_bus(i2c_periph);

    /* Cleanup */
    i2c_dma_last_transfer_config(i2c_periph, I2C_DMALST_OFF);
    i2c_dma_config(i2c_periph, I2C_DMA_OFF);

    return result;
}
#endif /* BSP_USING_I2C_RX_DMA && GD32_I2C_HAS_LEGACY_IP */


