GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
    RT_ASSERT(bus != RT_NULL);

    struct gd32_i2c_bus *gd32_i2c = (struct gd32_i2c_bus *)bus->priv;

    for(i = 0; i < num; i++)
    {
        msg = &msgs[i];

        if(msg->flags & RT_I2C_RD)
        {
            r_total_byte += msg->len;
        }else{
            w_total_byte += msg->len;
        }
    }

#if defined(GD32_I2C_HAS_NEW_IP) && (defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA))
    /*
     * New IP DMA: Use seq DMA API when total transfer length >= threshold
     * and required DMA channels are available for all message directions.
     * Handles arbitrary msg patterns (EEPROM read/write, multi-msg, etc.)
     */
    if (!IS_I2C_LEGACY(gd32_i2c->i2c_periph))
    {
        if ((w_total_byte + r_total_byte) >= I2C_DMA_TRANS_MIN_LEN &&
            (r_total_byte == 0 || gd32_i2c->dma_rx != RT_NULL) &&
            (w_total_byte == 0 || gd32_i2c->dma_tx != RT_NULL))
        {
            for (i = 0; i < num; i++)
            {
                msg = &msgs[i];
                struct rt_i2c_msg *next_msg = (i < num - 1) ? &msgs[i + 1] : RT_NULL;
                uint32_t frame_mode = gd32_i2c_new_frame_mode(msg, next_msg, i, num);
                int result;

                uint8_t is_read = (msg->flags & RT_I2C_RD) != 0;
                struct dma_config *dma = is_read ? gd32_i2c->dma_rx : gd32_i2c->dma_tx;

                if (dma != RT_NULL)
                {
                    result = gd32_i2c_new_dma_xfer(gd32_i2c, msg, frame_mode, is_read);
                }
                else
                {
                    result = -RT_ENOSYS;
                }

                if (result != 0)
                {
                    /* gd32_i2c_new_dma_xfer sent STOP on error, wait for completion and clear flag */
                    if (result != -RT_ENOSYS)
                    {
                        gd32_i2c_new_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_STPDET_GD, 1, timeout);
                        i2c_flag_clear_gd(gd32_i2c->i2c_periph, I2C_FLAG_STPDET_GD);
                    }
                    return -RT_ERROR;
                }
            }
            return num;
        }
    }
#endif /* GD32_I2C_HAS_NEW_IP && (BSP_USING_I2C_RX_DMA || BSP_USING_I2C_TX_DMA) */

    for(i = 0; i < num; i++)
    {
        msg = &msgs[i];
        addr = msg->addr << 1;
        if (!(msg->flags & RT_I2C_NO_START))
        {
    #ifdef GD32_I2C_HAS_LEGACY_IP
            if(IS_I2C_LEGACY(gd32_i2c->i2c_periph))
            {
                if(msg->flags & RT_I2C_RD)
                {
                        /* enable acknowledge */
                    i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_ENABLE);
                    if (msg->len == 2U)
                    {
                        /* Configure ACK position for 2-byte read */
                        i2c_ackpos_config(gd32_i2c->i2c_periph, I2C_ACKPOS_NEXT);
                    }
                        /* send the start signal */
                    i2c_start_on_bus(gd32_i2c->i2c_periph);
                     /* i2c master sends START signal successfully */
                    if (gd32_i2c_legacy_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, 1, timeout) != 0)
                        goto out;

                    i2c_master_addressing(gd32_i2c->i2c_periph, addr, I2C_RECEIVER);

                    if (gd32_i2c_legacy_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, 1, timeout) != 0)
                        goto out;

#if defined(BSP_USING_I2C_RX_DMA)
                    /* Legacy I2C RX DMA: must configure DMA BEFORE clearing ADDSEND */
                    if (msg->len >= I2C_DMA_TRANS_MIN_LEN && msg->len >= 2 && gd32_i2c->dma_rx != RT_NULL)
                    {
                        /* DMA read handles ADDSEND clear, data transfer, and STOP internally */
                        if (gd32_i2c_legacy_dma_read(gd32_i2c, msg) != 0)
                        {
                            LOG_E("i2c bus dma read failed!");
                            goto out;
                        }
                        /* Mark that DMA read is done, skip polling read later */
                    }
                    else
#endif
                    {
                        /* Polling read: original flow */
                        /* address flag set means i2c slave sends ACK */
                        if (msg->len <= 2)
                        {
                            i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_DISABLE);
                        }
                        i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
                        if (msg->len == 1)
                        {
                            i2c_stop_on_bus(gd32_i2c->i2c_periph);
                        }
                    }

               }else {
                     /* configure slave address */
                    if (gd32_i2c_legacy_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY, 0, timeout) != 0)
                        goto out;
                     //i2c_transfer_byte_number_config(gd32_i2c->i2c_periph, w_total_byte);
                     /* send a start condition to I2C bus */
                    i2c_start_on_bus(gd32_i2c->i2c_periph);
                    if (gd32_i2c_legacy_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, 1, timeout) != 0)
                        goto out;

                    i2c_master_addressing(gd32_i2c->i2c_periph, addr, I2C_TRANSMITTER);
                    if (gd32_i2c_legacy_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, 1, timeout) != 0)
                        goto out;

                    i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
               }
            }else
#endif
            {
#ifdef GD32_I2C_HAS_NEW_IP
                if(msg->flags & RT_I2C_ADDR_10BIT)
                {
                        /* enable 10-bit addressing mode in master mode */
                    i2c_address10_enable_gd(gd32_i2c->i2c_periph);
                }else {
                        /* disable 10-bit addressing mode in master mode */
                    i2c_address10_disable_gd(gd32_i2c->i2c_periph);
                }

                if(msg->flags & RT_I2C_RD)
                {
                     /* configure slave address */
                    i2c_master_addressing_gd(gd32_i2c->i2c_periph, addr, I2C_MASTER_RECEIVE_GD);

                    i2c_transfer_byte_number_config_gd(gd32_i2c->i2c_periph, r_total_byte);
                     /* send a start condition to I2C bus */
                    i2c_start_on_bus_gd(gd32_i2c->i2c_periph);

                }else {
                     /* configure slave address */
                    i2c_master_addressing_gd(gd32_i2c->i2c_periph, addr, I2C_MASTER_TRANSMIT_GD);
                    if (gd32_i2c_new_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY_GD, 0, timeout) != 0)
                        goto out;
                    i2c_transfer_byte_number_config_gd(gd32_i2c->i2c_periph, w_total_byte);
                     /* send a start condition to I2C bus */
                    i2c_start_on_bus_gd(gd32_i2c->i2c_periph);
                }
#endif
            }
        }

        if(msg->flags & RT_I2C_RD)
        {
#if defined(BSP_USING_I2C_RX_DMA) && defined(GD32_I2C_HAS_LEGACY_IP)
            /* Skip polling read if DMA read was already done above */
            if (IS_I2C_LEGACY(gd32_i2c->i2c_periph) &&
                msg->len >= I2C_DMA_TRANS_MIN_LEN && msg->len >= 2 && gd32_i2c->dma_rx != RT_NULL)
            {
                /* DMA read already completed in the address phase, nothing to do here */
            }
            else
#endif
            {
                if(gd32_i2c_read(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
                {
                    LOG_E("i2c bus read failed,i2c bus stop!");
                    goto out;
                }
            }
        }else {
#if defined(BSP_USING_I2C_TX_DMA) && defined(GD32_I2C_HAS_LEGACY_IP)
            /* Legacy I2C TX DMA */
            if (IS_I2C_LEGACY(gd32_i2c->i2c_periph) &&
                msg->len >= I2C_DMA_TRANS_MIN_LEN && gd32_i2c->dma_tx != RT_NULL)
            {
                if(gd32_i2c_legacy_dma_write(gd32_i2c, msg) != 0)
                {
                    LOG_E("i2c bus dma write failed,i2c bus stop!");
                    goto out;
                }
            }
            else
#endif
            {
                if(gd32_i2c_write(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
                {
                    LOG_E("i2c bus write failed,i2c bus stop!");
                    goto out;
                }
            }
       }
#ifdef GD32_I2C_HAS_NEW_IP
        if(!IS_I2C_LEGACY(gd32_i2c->i2c_periph))
        {
            if(r_total_byte != 0)
            {
                if (gd32_i2c_new_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_TC_GD, 1, timeout) != 0)
                    goto out;
            }
        }
#endif

